---
kind: method
id: M:Autodesk.Revit.DB.TableCellStyle.GetCellStyleOverrideOptions
source: html/4c375ee0-f561-b92d-549d-2ffb75a85880.htm
---
# Autodesk.Revit.DB.TableCellStyle.GetCellStyleOverrideOptions Method

Gets cell style override options of this cell.

## Syntax (C#)
```csharp
public TableCellStyleOverrideOptions GetCellStyleOverrideOptions()
```